Imports MySql.Data.MySqlClient

Module updateDatabase1522
    Friend Sub updateDatabase_1522()
        Try
            strSQL = "DROP TABLE IF EXISTS `access_lavel`;"
            cmd = New MySqlCommand(strSQL, ConnectionDB)
            Call open_connection()
            cmd.ExecuteNonQuery()
        Catch ex As Exception

        End Try
        Try
            strSQL = "CREATE TABLE IF NOT EXISTS `access_lavel` (" & _
                        "`id` int(10) unsigned NOT NULL AUTO_INCREMENT," & _
                        "`access` int(10) DEFAULT '0'," & _
                        "`zone` varchar(100) DEFAULT '-'," & _
                        "`link` varchar(100) DEFAULT '-'," & _
                        "`leval` int(5) DEFAULT '1' COMMENT '1 ผู้ใช้งาน 2 หัวหน้า 3 ผู้ดูแล'," & _
                        "`datetime_edit` varchar(50) DEFAULT '-'," & _
                        "PRIMARY KEY (`id`)" & _
                        ") ENGINE=MyISAM AUTO_INCREMENT=71 DEFAULT CHARSET=utf8;"
            cmd = New MySqlCommand(strSQL, ConnectionDB)
            Call open_connection()
            cmd.ExecuteNonQuery()
        Catch ex As Exception

        End Try

        Try
            strSQL = "DELETE FROM `access_lavel`;"
            cmd = New MySqlCommand(strSQL, ConnectionDB)
            Call open_connection()
            cmd.ExecuteNonQuery()
        Catch ex As Exception

        End Try

        Try
            strSQL = "INSERT INTO `access_lavel` (`id`, `access`, `zone`, `link`, `leval`, `datetime_edit`) VALUES" & _
    "(1, 1, 'ผู้ใช้งาน', 'ตั้งค่า >> ผู้ใช้งาน', 3, '-')," & _
    "(2, 0, 'ข้อมูลลูกค้า', 'ตั้งค่า >> ข้อมูลลูกค้า', 1, '-')," & _
    "(3, 1, 'ตั้งค่าโปรแกรม', 'ตั้งค่า >> ตั้งค่าโปรแกรม >> ตั้งค่าโปรแกรม', 3, '-')," & _
    "(4, 1, 'ตั้งค่าข้อมูลบัตรเครดิต', 'ตั้งค่า >> ตั้งค่าโปรแกรม >> ตั้งค่าข้อมูลบัตรเครดิต', 3, '-')," & _
    "(5, 1, 'ตั้งค่าสิทธิการใช้งานโปรแกรม', 'ตั้งค่า >> ตั้งค่าโปรแกรม >> ตั้งค่าสิทธิการใช้งานโปรแกรม', 3, '-')," & _
    "(6, 0, 'สำรองฐานข้อมูล', 'ตั้งค่า >> จัดการฐานข้อมูล >> สำรองฐานข้อมูล', 1, '-')," & _
    "(7, 1, 'นำเข้าฐานข้อมูล', 'ตั้งค่า >> จัดการฐานข้อมูล >> นำเข้าฐานข้อมูล', 3, '-')," & _
    "(8, 1, 'เปลี่ยนฐานข้อมูล', 'ตั้งค่า >> จัดการฐานข้อมูล >> เปลี่ยนฐานข้อมูล', 3, '-')," & _
    "(9, 0, 'ปรับปรุงฐานข้อมูล', 'ตั้งค่า >> จัดการฐานข้อมูล >> ปรับปรุงฐานข้อมูล', 3, '-')," & _
    "(10, 1, 'User Logs', 'ตั้งค่า >> Logs >> User Logs', 1, '-')," & _
    "(11, 1, 'ข้อมูลสถานประกอบการ', 'ตั้งค่า >> ข้อมูลสถานประกอบการ', 3, '-')," & _
    "(12, 1, 'รับงานซ่อม', 'งานช่าง >> รับงานซ่อม', 1, '-')," & _
    "(13, 1, 'สถานะงานซ่อม', 'งานช่าง >> สถานะงานซ่อม', 1, '-')," & _
    "(14, 0, 'ค้นหางานซ่อม', 'งานช่าง >> ค้นหางานซ่อม', 1, '-')," & _
    "(15, 1, 'ส่งคืนงานซ่อม', 'งานช่าง >> ส่งคืนงานซ่อม', 1, '-')," & _
    "(16, 0, 'รายงานการซ่อมตามรายชื่อช่างซ่อม', 'งานช่าง >> รายงาน >> รายงานการซ่อมตามรายชื่อช่างซ่อม', 1, '-')," & _
    "(17, 0, 'รายงานประวิติงานซ่อม', 'งานช่าง >> รายงาน >> รายงานประวัติงานซ่อม', 1, '-')," & _
    "(18, 0, 'สถิติงานช่าง', 'งานช่าง >> รายงาน >> สถิติงานช่าง', 1, '-')," & _
    "(19, 0, 'รายงานการเบิกสินค้า แบบแสดงรายชื่อสินค้า', 'งานช่าง >> รายงาน >> รายงานการเบิกสินค้า แบบแสดงรายชื่อสินค้า', 1, '-')," & _
    "(20, 0, 'รายงานรวมเบิกสินค้าตามวันที่', 'งานช่าง >> รายงาน >> รายงานเบิกสินค้าตามวันที่', 1, '-')," & _
    "(21, 0, 'เช็คประกันงานซ่อม', 'งานช่าง >> เช็คประกัน/ประวัติ >> เช็คประกันงานซ่อม', 1, '-')," & _
    "(22, 0, 'เช็คประวิติซ่อมเปลี่ยนอะไหล่', 'งานช่าง >> เช็คประกัน/ประวิติ >> เช็คประวิติซ่อมเปลี่ยนอะไหล่', 1, '-')," & _
    "(23, 0, 'เช็คประกันกับบริษัทผู้จำหน่าย', 'งานช่าง >> เช็คประกัน/ประวัติ >> เช็คประกันกับบริษัทผู้จำหน่าย', 1, '-')," & _
    "(24, 1, 'ข้อมูลประเภทสินค้า', 'งานช่าง >> ตั้งค่าข้อมูลงานช่าง >> ข้อมูลประเภทสินค้า', 1, '-')," & _
    "(25, 0, 'ข้อมูลยี่ห้อสินค้า', 'งานช่าง >> ตั้งค่าข้อมูลงานช่าง >> ข้อมูลยี่ห้อสินค้า', 1, '-')," & _
    "(26, 1, 'ข้อมูลอาการเสีย', 'งานช่าง >> ตั้งค่าข้อมูลงานช่าง >> ข้อมูลอาการเสีย', 1, '-')," & _
    "(27, 1, 'ข้อมูลการจัดการข้อมูล', 'งานช่าง >> ตั้งค่าข้อมูลงานช่าง >> ข้อมูลการจัดการข้อมูล', 1, '-')," & _
    "(28, 1, 'ข้อมูลอุปกรณ์ที่นำมาด้วย', 'งานช่าง >> ตั้งค่าข้อมูลงานช่าง >> ข้อมูลอุปกรณ์ที่นำมาด้วย', 1, '-')," & _
    "(29, 1, 'ข้อมูลสีตัวสินค้า', 'งานช่าง >> ตั้งค่าข้อมูลงานช่าง >> ข้อมูลสีตัวสินค้า', 1, '-')," & _
    "(30, 1, 'ข้อมูล SN เครื่องซ่อม', 'งานช่าง >> ตั้งค่าข้อมูลงานช่าง >> ข้อมูล SN เครื่องซ่อม', 1, '-')," & _
    "(31, 0, 'พิมพ์ใบรับซ่อม/ส่งคืนย้อนหลัง', 'งานช่าง >> พิมพ์ >> พิมพ์ใบรับซ่อม/ส่งคืนย้อนหลัง', 1, '-')," & _
    "(33, 0, 'รายการสั่งซื้อสินค้า', 'งานจัดซื้อ >> รายการสั่งซื้อสินค้า', 1, '-')," & _
    "(32, 0, 'สั่งซื้อสินค้า', 'งานจัดซื้อ >> สั่งซื้อสินค้า', 1, '-')," & _
    "(34, 0, 'รับสินค้าเข้าระบบ', 'งานจัดซื้อ >> รับสินค้าเข้าระบบ', 1, '-')," & _
    "(35, 0, 'รายชื่อบริษัทที่สั่งซื้อ', 'งานจัดซื้อ >> รายชื่อบริษัทที่จัดซื้อ', 1, '-')," & _
    "(36, 0, 'รายงานการรับสินค้า', 'งานจัดซื้อ >> รายงานการรับสินค้า', 1, '-')," & _
    "(37, 0, 'ขายสินค้า', 'งานขาย >> ขายสินค้า', 1, '-')," & _
    "(38, 0, 'คืนสินค้า/ยกเลิกบิลขาย', 'งานขาย >> ขายสินค้า/ยกเลิกบิลขาย', 1, '-')," & _
    "(39, 0, 'รายงานรวมขายสินค้าตามวันที่', 'งานขาย >> รายงานรวมขายสินค้าตามวันที่', 1, '-')," & _
    "(40, 0, 'รายงานขาย แบบแสดงรายชื่อสินค้า', 'งานขาย >> รายงานขาย แบบแสดงรายชื่อสินค้า', 1, '-')," & _
    "(41, 0, 'รายงานการคืน รวม', 'งานขาย >> รายงานการคืน รวม', 1, '-')," & _
    "(42, 0, 'รายงานคืนสินค้าแบบแสดงชื่อสินค้า', 'งานขาย >> รายงานคืนสินค้าแบบแสดงชื่อสินค้า', 1, '-')," & _
    "(43, 0, 'สถิติงานขาย', 'งานขาย >> สถิติงานขาย', 1, '-')," & _
    "(44, 0, 'ตรวจสอบราคาสินค้า', 'งานขาย >> ตรวจสอบราคาสินค้า', 1, '-')," & _
    "(45, 0, 'เช็คประกันตัวสินค้า', 'งานขาย >> เช็คประกันตัวสินค้า', 1, '-')," & _
    "(46, 1, 'รับเคลมสินค้า', 'งานเคลม >> รับเคลมสินค้า', 1, '-')," & _
    "(47, 1, 'เตรียมสินค้าเคลม', 'งามเคลม >> จัดการสินค้าเคลม(ส่งออกข้างนอก) >> เตรียมสินค้าเคลม ', 1, '-')," & _
    "(48, 1, 'ส่งสินค้าเคลม', 'งามเคลม >> จัดการสินค้าเคลม(ส่งออกข้างนอก) >> ส่งสินค้าเคลม', 1, '-')," & _
    "(49, 1, 'รับเข้าสินค้าเคลม', 'งามเคลม >> จัดการสินค้าเคลม(ส่งออกข้างนอก) >> รับเข้าสินค้าเคลม', 1, '-')," & _
    "(50, 1, 'ทดสอบสินค้าเคลม', 'งามเคลม >> จัดการสินค้าเคลม(ส่งออกข้างนอก) >> ทดสอบสินค้าเคลม', 1, '-')," & _
    "(51, 1, 'นำเข้าสินค้าเคลม', 'งามเคลม >> จัดการสินค้าเคลม(ส่งออกข้างนอก) >> นำเข้าสินค้าเคลม', 1, '-')," & _
    "(52, 1, 'ติดตามสถานะเคลม', 'งานเคลม >> ติดตามสถานะเคลม', 1, '-')," & _
    "(53, 1, 'คืนสินค้าเคลม', 'งานเคลม >> คืนสินค้าเคลม', 1, '-')," & _
    "(54, 0, 'พิมพ์ใบปะหน้ากล่อง', 'งานเคลม >> พิมพ์ใบปะหน้ากล่อง', 1, '-')," & _
    "(55, 0, 'รายงานการเคลม', 'งานเคลม >> รายงานการเคลม', 1, '-')," & _
    "(56, 1, 'ลูกหนี้ค้างจ่าย', 'งานบัญชี/การเงิน >> ลูกหนี้ค้างจ่าย', 1, '-')," & _
    "(57, 1, 'ตรวจสอบบัญชี/บันทึกค่าใช้จ่าย', 'งานบัญชี/การเงิน >> ตรวจสอบบัญชี/บันทึกค่าใช้จ่าย', 1, '-')," & _
    "(58, 0, 'รายงานรายรับ/รายจ่าย', 'งานบัญชี/การเงิน >> รายงาน >> รายงานรายรับ/รายจ่าย', 1, '-')," & _
    "(59, 0, 'สถิติรายปี', 'งานบัญชี/การเงิน >> รายงาน >> สถิติรายปี', 1, '-')," & _
    "(60, 0, 'รายการสินค้า', 'สต็อกสินค้า >> รายการสินค้า', 1, '-')," & _
    "(61, 0, 'เช็คสต็อก Serial Number', 'สต็อกสินค้า >> เช็คสต็อก >> เช็คสต็อก Serial Number', 1, '-')," & _
    "(62, 0, 'เช็คสต็อกบาร์โค๊ต', 'สต็อกสินค้า >> เช็คสต็อก >> เช็คสต็อกบาร์โค๊ต', 1, '-')," & _
    "(63, 0, 'รายงานตรวจสอบสต็อก SN', 'สต็อกสินค้า >> รายงาน >> รายงานตรวจสอบสต็อก SN', 1, '-')," & _
    "(64, 0, 'รายงานตรวจสอบสต็อกบาร์โค๊ต', 'สต็อกสินค้า >> รายงาน >> รายงานตรวจสอบสต็อกบาร์โค๊ต', 1, '-')," & _
    "(65, 0, 'รายงานยอดรวมสต็อก', 'สต็อกสินค้า >> รายงาน >> รายงานยอดรวมสต็อก', 1, '-')," & _
    "(66, 0, 'รายงานจำนวนสต็อก', 'สต็อกสินค้า >> รายงาน >> รายงานจำนวนสต็อก', 1, '-')," & _
    "(67, 0, 'ออกใบเสนอราคา', 'ออกใบต่าง ๆ >> ใบเสนอราคา >> ออกใบเสนิราคา', 1, '-')," & _
    "(68, 0, 'ค้นหาใบเสนอราคา', 'ออกใบต่าง ๆ >> ใบเสนอราคา >> ค้นหาใบเสนอราคา', 1, '-')," & _
    "(69, 0, 'ออกใบกำกับภาษี/ใบส่งของ', 'ออกใบต่าง ๆ >> ออกใบกำกับภาษี/ใบส่งของ', 1, '-')," & _
    "(70, 1, 'เบิกอะไหล่/ค่าซ่อม', 'งานช่าง >> สถานะงานซ่อม >> เบิกอะไหล์/ค่าซ่อม(ปุ่ม)', 1, '-');"
            cmd = New MySqlCommand(strSQL, ConnectionDB)
            Call open_connection()
            cmd.ExecuteNonQuery()
        Catch ex As Exception

        End Try

        Try
            strSQL = "UPDATE `database_version` SET `version`='3.2';"
            cmd = New MySqlCommand(strSQL, ConnectionDB)
            Call open_connection()
            cmd.ExecuteNonQuery()
        Catch ex As Exception

        End Try
    End Sub
End Module
